#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform plan:

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.inline["S3Artifacts"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowS3ArtifactsAccess"
        }
    }

  # aws_cloudwatch_log_group.demo-cd-log["troy-organization"] will be created
  + resource "aws_cloudwatch_log_group" "demo-cd-log" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + kms_key_id                  = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/codebuild/troy-organization-demo-codebuild-tf-prod-cd"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-1"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "Name" = "/aws/codebuild/troy-organization-demo-codebuild-tf-prod-cd"
        }
      + tags_all                    = {
          + "ManagedBy"    = "Terraform"
          + "Name"         = "/aws/codebuild/troy-organization-demo-codebuild-tf-prod-cd"
          + "Organization" = "troy-organization"
          + "Purpose"      = "This CodeBuild project is used for troy-organization organization"
          + "Region"       = "ap-southeast-1"
        }
    }

  # aws_cloudwatch_log_group.demo-ci-log["troy-organization"] will be created
  + resource "aws_cloudwatch_log_group" "demo-ci-log" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + kms_key_id                  = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/codebuild/troy-organization-demo-codebuild-tf-prod-ci"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-1"
      + retention_in_days           = 30
      + skip_destroy                = false
      + tags                        = {
          + "Name" = "/aws/codebuild/troy-organization-demo-codebuild-tf-prod-ci"
        }
      + tags_all                    = {
          + "ManagedBy"    = "Terraform"
          + "Name"         = "/aws/codebuild/troy-organization-demo-codebuild-tf-prod-ci"
          + "Organization" = "troy-organization"
          + "Purpose"      = "This CodeBuild project is used for troy-organization organization"
          + "Region"       = "ap-southeast-1"
        }
    }

  # aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "troy-organization-demo-codebuild-tf-share-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "troy-organization-demo-codebuild-tf-share-role"
        }
      + tags_all              = {
          + "ManagedBy"    = "Terraform"
          + "Name"         = "troy-organization-demo-codebuild-tf-share-role"
          + "Organization" = "troy-organization"
          + "Purpose"      = "This CodeBuild project is used for troy-organization organization"
          + "Region"       = "ap-southeast-1"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.inline["CICD"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "CICD"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codebuild:UpdateReport",
                          + "codebuild:CreateReportGroup",
                          + "codebuild:CreateReport",
                          + "codebuild:BatchPutTestCases",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:codebuild:ap-southeast-1:381492178574:report-group/*"
                      + Sid      = "AllowCICDAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["CodeArtifact"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "CodeArtifact"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codeartifact:ReadFromRepository",
                          + "codeartifact:GetRepositoryEndpoint",
                          + "codeartifact:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowCodeArtifactAccess"
                    },
                  + {
                      + Action    = "sts:GetServiceBearerToken"
                      + Condition = {
                          + StringEquals = {
                              + "sts:AWSServiceName" = "codeartifact.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["CodeConnections"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "CodeConnections"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codeconnections:GetConnectionToken",
                          + "codeconnections:GetConnection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:codeconnections:ap-southeast-1:381492178574:connection/*"
                      + Sid      = "AllowCodeConnectionsAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["ECR"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "ECR"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowECRAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["KMS"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "KMS"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowKMSAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["Logs"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "Logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ap-southeast-1:381492178574:log-group:/aws/codebuild/*"
                      + Sid      = "AllowLogsAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["Networking"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "Networking"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterfacePermission",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowNetworkingAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["S3Artifacts"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "S3Artifacts"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["S3StateFile"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "S3StateFile"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::demo-terraform-backend-state/*.tflock"
                      + Sid      = "AllowS3StateFileAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.inline["Secrets"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "Secrets"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSecretsManagerAccess"
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                          + "ssm:DescribeParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSSMParameterStoreAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_kms_alias.alias_kms will be created
  + resource "aws_kms_alias" "alias_kms" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/troy-organization-demo-codebuild-tf-share-kms"
      + name_prefix    = (known after apply)
      + region         = "ap-southeast-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.demo_kms will be created
  + resource "aws_kms_key" "demo_kms" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "An example symmetric encryption KMS key for CodeBuild"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "ap-southeast-1"
      + rotation_period_in_days            = 90
      + tags                               = {
          + "Name" = "troy-organization-demo-codebuild-tf-share-kms"
        }
      + tags_all                           = {
          + "ManagedBy"    = "Terraform"
          + "Name"         = "troy-organization-demo-codebuild-tf-share-kms"
          + "Organization" = "troy-organization"
          + "Purpose"      = "This CodeBuild project is used for troy-organization organization"
          + "Region"       = "ap-southeast-1"
        }
    }

  # aws_kms_key_policy.demo_kms will be created
  + resource "aws_kms_key_policy" "demo_kms" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "demo-kms-policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::381492178574:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey",
                          + "kms:GenerateDataKeyWithoutPlaintext",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow use of the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                             = "ap-southeast-1"
    }

  # aws_s3_bucket.artifacts["troy-organization"] will be created
  + resource "aws_s3_bucket" "artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "troy-organization-demo-codebuild-tf-share-artifacts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "troy-organization-demo-codebuild-tf-share-artifacts"
        }
      + tags_all                    = {
          + "ManagedBy"    = "Terraform"
          + "Name"         = "troy-organization-demo-codebuild-tf-share-artifacts"
          + "Organization" = "troy-organization"
          + "Purpose"      = "This CodeBuild project is used for troy-organization organization"
          + "Region"       = "ap-southeast-1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.cache["troy-organization"] will be created
  + resource "aws_s3_bucket" "cache" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "troy-organization-demo-codebuild-tf-share-cache"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "troy-organization-demo-codebuild-tf-share-cache"
        }
      + tags_all                    = {
          + "ManagedBy"    = "Terraform"
          + "Name"         = "troy-organization-demo-codebuild-tf-share-cache"
          + "Organization" = "troy-organization"
          + "Purpose"      = "This CodeBuild project is used for troy-organization organization"
          + "Region"       = "ap-southeast-1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.demo-cd["troy-organization"].aws_codebuild_project.this will be created
  + resource "aws_codebuild_project" "this" {
      + arn                  = (known after apply)
      + auto_retry_limit     = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 60
      + description          = "This CodeBuild project is used for troy-organization organization"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "troy-organization-demo-codebuild-tf-prod-cd"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + region               = "ap-southeast-1"
      + service_role         = (known after apply)
      + tags                 = {
          + "Name" = "troy-organization-demo-codebuild-tf-prod-cd"
        }
      + tags_all             = {
          + "ManagedBy"    = "Terraform"
          + "Name"         = "troy-organization-demo-codebuild-tf-prod-cd"
          + "Organization" = "troy-organization"
          + "Purpose"      = "This CodeBuild project is used for troy-organization organization"
          + "Region"       = "ap-southeast-1"
        }

      + artifacts {
          + encryption_disabled    = false
          + location               = "troy-organization-demo-codebuild-tf-share-artifacts"
          + namespace_type         = "BUILD_ID"
          + override_artifact_name = false
          + path                   = "artifacts"
          + type                   = "S3"
        }

      + cache {
          + location = "troy-organization-demo-codebuild-tf-share-cache"
          + type     = "S3"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_MEDIUM"
          + image                       = "aws/codebuild/amazonlinux-x86_64-standard:5.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "HTTP_PROXY"
              + type  = "PLAINTEXT"
              + value = "http://troynguyeen-demo.vn:80"
            }
          + environment_variable {
              + name  = "HTTPS_PROXY"
              + type  = "PLAINTEXT"
              + value = "http://troynguyeen-demo.vn:80"
            }
          + environment_variable {
              + name  = "NO_PROXY"
              + type  = "PLAINTEXT"
              + value = "127.0.0.1,localhost,::1"
            }
        }

      + logs_config {
          + cloudwatch_logs {
              + status = "ENABLED"
            }
        }

      + source {
          + insecure_ssl        = false
          + location            = "CODEBUILD_DEFAULT_WEBHOOK_SOURCE_LOCATION"
          + report_build_status = false
          + type                = "GITHUB"
            # (1 unchanged attribute hidden)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0e137ea38b703910f",
            ]
          + subnets            = [
              + "subnet-0955ef0e101e581bf",
              + "subnet-0e19b3ae7f18c754d",
            ]
          + vpc_id             = "vpc-0cdaed73ee1f56a9d"
        }
    }

  # module.demo-cd["troy-organization"].aws_codebuild_source_credential.this[0] will be created
  + resource "aws_codebuild_source_credential" "this" {
      + arn         = (known after apply)
      + auth_type   = "CODECONNECTIONS"
      + id          = (known after apply)
      + region      = "ap-southeast-1"
      + server_type = "GITHUB"
      + token       = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.demo-cd["troy-organization"].aws_codebuild_webhook.this[0] will be created
  + resource "aws_codebuild_webhook" "this" {
      + build_type      = "BUILD"
      + id              = (known after apply)
      + manual_creation = false
      + payload_url     = (known after apply)
      + project_name    = "troy-organization-demo-codebuild-tf-prod-cd"
      + region          = "ap-southeast-1"
      + secret          = (sensitive value)
      + url             = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "WORKFLOW_JOB_QUEUED"
              + type                    = "EVENT"
            }
        }

      + pull_request_build_policy (known after apply)

      + scope_configuration {
          + name  = "troy-organization"
          + scope = "GITHUB_ORGANIZATION"
        }
    }

  # module.demo-ci["troy-organization"].aws_codebuild_project.this will be created
  + resource "aws_codebuild_project" "this" {
      + arn                  = (known after apply)
      + auto_retry_limit     = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 60
      + description          = "This CodeBuild project is used for troy-organization organization"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "troy-organization-demo-codebuild-tf-prod-ci"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + region               = "ap-southeast-1"
      + service_role         = (known after apply)
      + tags                 = {
          + "Name" = "troy-organization-demo-codebuild-tf-prod-ci"
        }
      + tags_all             = {
          + "ManagedBy"    = "Terraform"
          + "Name"         = "troy-organization-demo-codebuild-tf-prod-ci"
          + "Organization" = "troy-organization"
          + "Purpose"      = "This CodeBuild project is used for troy-organization organization"
          + "Region"       = "ap-southeast-1"
        }

      + artifacts {
          + encryption_disabled    = false
          + location               = "troy-organization-demo-codebuild-tf-share-artifacts"
          + namespace_type         = "BUILD_ID"
          + override_artifact_name = false
          + path                   = "artifacts"
          + type                   = "S3"
        }

      + cache {
          + location = "troy-organization-demo-codebuild-tf-share-cache"
          + type     = "S3"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_MEDIUM"
          + image                       = "aws/codebuild/amazonlinux-x86_64-standard:5.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "HTTP_PROXY"
              + type  = "PLAINTEXT"
              + value = "http://troynguyeen-demo.vn:80"
            }
          + environment_variable {
              + name  = "HTTPS_PROXY"
              + type  = "PLAINTEXT"
              + value = "http://troynguyeen-demo.vn:80"
            }
          + environment_variable {
              + name  = "NO_PROXY"
              + type  = "PLAINTEXT"
              + value = "127.0.0.1,localhost,::1"
            }
        }

      + logs_config {
          + cloudwatch_logs {
              + status = "ENABLED"
            }
        }

      + source {
          + insecure_ssl        = false
          + location            = "CODEBUILD_DEFAULT_WEBHOOK_SOURCE_LOCATION"
          + report_build_status = false
          + type                = "GITHUB"
            # (1 unchanged attribute hidden)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0e137ea38b703910f",
            ]
          + subnets            = [
              + "subnet-0955ef0e101e581bf",
              + "subnet-0e19b3ae7f18c754d",
            ]
          + vpc_id             = "vpc-0cdaed73ee1f56a9d"
        }
    }

  # module.demo-ci["troy-organization"].aws_codebuild_source_credential.this[0] will be created
  + resource "aws_codebuild_source_credential" "this" {
      + arn         = (known after apply)
      + auth_type   = "CODECONNECTIONS"
      + id          = (known after apply)
      + region      = "ap-southeast-1"
      + server_type = "GITHUB"
      + token       = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.demo-ci["troy-organization"].aws_codebuild_webhook.this[0] will be created
  + resource "aws_codebuild_webhook" "this" {
      + build_type      = "BUILD"
      + id              = (known after apply)
      + manual_creation = false
      + payload_url     = (known after apply)
      + project_name    = "troy-organization-demo-codebuild-tf-prod-ci"
      + region          = "ap-southeast-1"
      + secret          = (sensitive value)
      + url             = (known after apply)

      + filter_group {
          + filter {
              + exclude_matched_pattern = false
              + pattern                 = "WORKFLOW_JOB_QUEUED"
              + type                    = "EVENT"
            }
        }

      + pull_request_build_policy (known after apply)

      + scope_configuration {
          + name  = "troy-organization"
          + scope = "GITHUB_ORGANIZATION"
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + demo_kms_arn = (known after apply)
```

</details>
*Pushed by: @troynguyeen, Action: `pull_request`*